In [1]:
import pandas as pd

In [2]:
ipl_d={'Team':['MI','CSK','CSK','MI','DEVILS','MI','KINGS','ROYALS','MI','CSK','KINGS','ROYALS'],
      'Rank':[1,2,3,2,3,1,4,2,3,2,1,3],
      'Year':[2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019],
      'Points':[869,954,824,947,972,996,912,833,884,798,855,882]}
df = pd.DataFrame(ipl_d)
df

      Team  Rank  Year  Points
0       MI     1  2008     869
1      CSK     2  2009     954
2      CSK     3  2010     824
3       MI     2  2011     947
4   DEVILS     3  2012     972
5       MI     1  2013     996
6    KINGS     4  2014     912
7   ROYALS     2  2015     833
8       MI     3  2016     884
9      CSK     2  2017     798
10   KINGS     1  2018     855
11  ROYALS     3  2019     882

In [3]:
df.Team

0         MI
1        CSK
2        CSK
3         MI
4     DEVILS
5         MI
6      KINGS
7     ROYALS
8         MI
9        CSK
10     KINGS
11    ROYALS
Name: Team, dtype: object

In [4]:
df['Points']

0     869
1     954
2     824
3     947
4     972
5     996
6     912
7     833
8     884
9     798
10    855
11    882
Name: Points, dtype: int64

In [5]:
df[['Rank']]

    Rank
0      1
1      2
2      3
3      2
4      3
5      1
6      4
7      2
8      3
9      2
10     1
11     3

In [6]:
df[['Team','Points','Rank']]

      Team  Points  Rank
0       MI     869     1
1      CSK     954     2
2      CSK     824     3
3       MI     947     2
4   DEVILS     972     3
5       MI     996     1
6    KINGS     912     4
7   ROYALS     833     2
8       MI     884     3
9      CSK     798     2
10   KINGS     855     1
11  ROYALS     882     3

In [7]:
df.loc[:,:]

      Team  Rank  Year  Points
0       MI     1  2008     869
1      CSK     2  2009     954
2      CSK     3  2010     824
3       MI     2  2011     947
4   DEVILS     3  2012     972
5       MI     1  2013     996
6    KINGS     4  2014     912
7   ROYALS     2  2015     833
8       MI     3  2016     884
9      CSK     2  2017     798
10   KINGS     1  2018     855
11  ROYALS     3  2019     882

In [8]:
df.loc[:,::3]

      Team  Points
0       MI     869
1      CSK     954
2      CSK     824
3       MI     947
4   DEVILS     972
5       MI     996
6    KINGS     912
7   ROYALS     833
8       MI     884
9      CSK     798
10   KINGS     855
11  ROYALS     882

In [9]:
df.loc[:,['Team','Points']]

      Team  Points
0       MI     869
1      CSK     954
2      CSK     824
3       MI     947
4   DEVILS     972
5       MI     996
6    KINGS     912
7   ROYALS     833
8       MI     884
9      CSK     798
10   KINGS     855
11  ROYALS     882

In [10]:
df.loc[:,'Team':'Year']

      Team  Rank  Year
0       MI     1  2008
1      CSK     2  2009
2      CSK     3  2010
3       MI     2  2011
4   DEVILS     3  2012
5       MI     1  2013
6    KINGS     4  2014
7   ROYALS     2  2015
8       MI     3  2016
9      CSK     2  2017
10   KINGS     1  2018
11  ROYALS     3  2019

In [11]:
df.iloc[:,1::1]

    Rank  Year  Points
0      1  2008     869
1      2  2009     954
2      3  2010     824
3      2  2011     947
4      3  2012     972
5      1  2013     996
6      4  2014     912
7      2  2015     833
8      3  2016     884
9      2  2017     798
10     1  2018     855
11     3  2019     882

In [12]:
df.iloc[:,::-1]

    Points  Year  Rank    Team
0      869  2008     1      MI
1      954  2009     2     CSK
2      824  2010     3     CSK
3      947  2011     2      MI
4      972  2012     3  DEVILS
5      996  2013     1      MI
6      912  2014     4   KINGS
7      833  2015     2  ROYALS
8      884  2016     3      MI
9      798  2017     2     CSK
10     855  2018     1   KINGS
11     882  2019     3  ROYALS

In [13]:
df.drop(columns=['Year','Rank'])

      Team  Points
0       MI     869
1      CSK     954
2      CSK     824
3       MI     947
4   DEVILS     972
5       MI     996
6    KINGS     912
7   ROYALS     833
8       MI     884
9      CSK     798
10   KINGS     855
11  ROYALS     882

In [14]:
df['Team'].unique()

array(['MI', 'CSK', 'DEVILS', 'KINGS', 'ROYALS'], dtype=object)

In [15]:
df['Team'].nunique()

5

In [16]:
df['Team'].unique().size

5

In [17]:
len(df['Team'].unique())

5

In [18]:
df.Team.value_counts()

MI        4
CSK       3
KINGS     2
ROYALS    2
DEVILS    1
Name: Team, dtype: int64

In [19]:
df.Team.value_counts(ascending=True)

DEVILS    1
KINGS     2
ROYALS    2
CSK       3
MI        4
Name: Team, dtype: int64

In [20]:
df.dtypes

Team      object
Rank       int64
Year       int64
Points     int64
dtype: object

In [21]:
tm = list(df.groupby('Team'))
tm

[('CSK',
    Team  Rank  Year  Points
  1  CSK     2  2009     954
  2  CSK     3  2010     824
  9  CSK     2  2017     798),
 ('DEVILS',
       Team  Rank  Year  Points
  4  DEVILS     3  2012     972),
 ('KINGS',
       Team  Rank  Year  Points
  6   KINGS     4  2014     912
  10  KINGS     1  2018     855),
 ('MI',
    Team  Rank  Year  Points
  0   MI     1  2008     869
  3   MI     2  2011     947
  5   MI     1  2013     996
  8   MI     3  2016     884),
 ('ROYALS',
        Team  Rank  Year  Points
  7   ROYALS     2  2015     833
  11  ROYALS     3  2019     882)]

In [22]:
for i in tm:
    print(i[1],end='\n\n')

  Team  Rank  Year  Points
1  CSK     2  2009     954
2  CSK     3  2010     824
9  CSK     2  2017     798

     Team  Rank  Year  Points
4  DEVILS     3  2012     972

     Team  Rank  Year  Points
6   KINGS     4  2014     912
10  KINGS     1  2018     855

  Team  Rank  Year  Points
0   MI     1  2008     869
3   MI     2  2011     947
5   MI     1  2013     996
8   MI     3  2016     884

      Team  Rank  Year  Points
7   ROYALS     2  2015     833
11  ROYALS     3  2019     882

In [23]:
for team,data in tm:
    if team == 'MI':
        print(data)

  Team  Rank  Year  Points
0   MI     1  2008     869
3   MI     2  2011     947
5   MI     1  2013     996
8   MI     3  2016     884

In [24]:
ts = list(df.groupby('Year'))
ts

[(2008,
    Team  Rank  Year  Points
  0   MI     1  2008     869),
 (2009,
    Team  Rank  Year  Points
  1  CSK     2  2009     954),
 (2010,
    Team  Rank  Year  Points
  2  CSK     3  2010     824),
 (2011,
    Team  Rank  Year  Points
  3   MI     2  2011     947),
 (2012,
       Team  Rank  Year  Points
  4  DEVILS     3  2012     972),
 (2013,
    Team  Rank  Year  Points
  5   MI     1  2013     996),
 (2014,
      Team  Rank  Year  Points
  6  KINGS     4  2014     912),
 (2015,
       Team  Rank  Year  Points
  7  ROYALS     2  2015     833),
 (2016,
    Team  Rank  Year  Points
  8   MI     3  2016     884),
 (2017,
    Team  Rank  Year  Points
  9  CSK     2  2017     798),
 (2018,
       Team  Rank  Year  Points
  10  KINGS     1  2018     855),
 (2019,
        Team  Rank  Year  Points
  11  ROYALS     3  2019     882)]

In [25]:
df[df.Year == 2017]

  Team  Rank  Year  Points
9  CSK     2  2017     798

In [26]:
df.query("Team =='MI'")

  Team  Rank  Year  Points
0   MI     1  2008     869
3   MI     2  2011     947
5   MI     1  2013     996
8   MI     3  2016     884

In [27]:
df.groupby('Points').groups

{798: [9], 824: [2], 833: [7], 855: [10], 869: [0], 882: [11], 884: [8], 912: [6], 947: [3], 954: [1], 972: [4], 996: [5]}

In [28]:
x = df.groupby('Team').groups
x

{'CSK': [1, 2, 9], 'DEVILS': [4], 'KINGS': [6, 10], 'MI': [0, 3, 5, 8], 'ROYALS': [7, 11]}

In [29]:
MI = x['MI']
MI

Int64Index([0, 3, 5, 8], dtype='int64')

In [30]:
df.loc[MI,:]

  Team  Rank  Year  Points
0   MI     1  2008     869
3   MI     2  2011     947
5   MI     1  2013     996
8   MI     3  2016     884

In [31]:
list(df.groupby(['Team','Points']))

[(('CSK', 798),
    Team  Rank  Year  Points
  9  CSK     2  2017     798),
 (('CSK', 824),
    Team  Rank  Year  Points
  2  CSK     3  2010     824),
 (('CSK', 954),
    Team  Rank  Year  Points
  1  CSK     2  2009     954),
 (('DEVILS', 972),
       Team  Rank  Year  Points
  4  DEVILS     3  2012     972),
 (('KINGS', 855),
       Team  Rank  Year  Points
  10  KINGS     1  2018     855),
 (('KINGS', 912),
      Team  Rank  Year  Points
  6  KINGS     4  2014     912),
 (('MI', 869),
    Team  Rank  Year  Points
  0   MI     1  2008     869),
 (('MI', 884),
    Team  Rank  Year  Points
  8   MI     3  2016     884),
 (('MI', 947),
    Team  Rank  Year  Points
  3   MI     2  2011     947),
 (('MI', 996),
    Team  Rank  Year  Points
  5   MI     1  2013     996),
 (('ROYALS', 833),
       Team  Rank  Year  Points
  7  ROYALS     2  2015     833),
 (('ROYALS', 882),
        Team  Rank  Year  Points
  11  ROYALS     3  2019     882)]

In [32]:
df.loc[:,['Rank','Points']]

    Rank  Points
0      1     869
1      2     954
2      3     824
3      2     947
4      3     972
5      1     996
6      4     912
7      2     833
8      3     884
9      2     798
10     1     855
11     3     882

In [33]:
df.groupby(['Team','Rank']).get_group(('MI',1))

  Team  Rank  Year  Points
0   MI     1  2008     869
5   MI     1  2013     996

In [34]:
df.groupby(['Team','Year']).get_group(('CSK',2009))

  Team  Rank  Year  Points
1  CSK     2  2009     954

In [35]:
#Record of year 2017
df.groupby(['Year']).get_group((2017))

  Team  Rank  Year  Points
9  CSK     2  2017     798

In [36]:
#number of first rank team
dx = df.groupby(['Rank']).get_group((1))
dx1 = dx.Team.value_counts().nlargest(1)
dx1

MI    2
Name: Team, dtype: int64

In [37]:
df[['Rank']].value_counts().nlargest(2)

Rank
2       4
3       4
dtype: int64

# AGGREGATIONS

In [38]:
dxx = df.groupby('Team')['Points']
dxx.agg(sum).nlargest(2)

Team
MI     3696
CSK    2576
Name: Points, dtype: int64

In [39]:
d1= df.groupby('Year')['Points']
d1.agg(sum).nlargest(2)

Year
2013    996
2012    972
Name: Points, dtype: int64

In [40]:
#list(d1)
d1.sum().nlargest(2)

Year
2013    996
2012    972
Name: Points, dtype: int64

In [41]:
dxx.agg([sum,min,max,'mean','median'])

         sum  min  max        mean  median
Team
CSK     2576  798  954  858.666667   824.0
DEVILS   972  972  972  972.000000   972.0
KINGS   1767  855  912  883.500000   883.5
MI      3696  869  996  924.000000   915.5
ROYALS  1715  833  882  857.500000   857.5

In [42]:
df.groupby('Team')['Points'].transform(lambda x:x/100)

0     8.69
1     9.54
2     8.24
3     9.47
4     9.72
5     9.96
6     9.12
7     8.33
8     8.84
9     7.98
10    8.55
11    8.82
Name: Points, dtype: float64

In [43]:
# I want to give the +10 exxtra points to csk use transform

list(df.groupby('Team')['Points']

SyntaxError: unexpected EOF while parsing (2950498910.py, line 3)

In [44]:
df[['Team','Points']].sum()

Team      MICSKCSKMIDEVILSMIKINGSROYALSMICSKKINGSROYALS
Points                                            10726
dtype: object

In [45]:
(df.groupby('Team').get_group('CSK')['Points'].agg(sum))+10

2586

In [47]:
df.groupby('Team').get_group('CSK')['Points'].transform(lambda x :x+10)  #each year added 10 points

1    964
2    834
9    808
Name: Points, dtype: int64

In [50]:
# I want to give extra +10 point only to the teams from year 2015
df.groupby('Year').get_group((2015))

     Team  Rank  Year  Points
7  ROYALS     2  2015     833

In [54]:
list(df.groupby(['Year']))[7:]

[(2015,
       Team  Rank  Year  Points
  7  ROYALS     2  2015     833),
 (2016,
    Team  Rank  Year  Points
  8   MI     3  2016     884),
 (2017,
    Team  Rank  Year  Points
  9  CSK     2  2017     798),
 (2018,
       Team  Rank  Year  Points
  10  KINGS     1  2018     855),
 (2019,
        Team  Rank  Year  Points
  11  ROYALS     3  2019     882)]

In [58]:
list(df.groupby(['Year'])['Team'])

[(2008,
  0    MI
  Name: Team, dtype: object),
 (2009,
  1    CSK
  Name: Team, dtype: object),
 (2010,
  2    CSK
  Name: Team, dtype: object),
 (2011,
  3    MI
  Name: Team, dtype: object),
 (2012,
  4    DEVILS
  Name: Team, dtype: object),
 (2013,
  5    MI
  Name: Team, dtype: object),
 (2014,
  6    KINGS
  Name: Team, dtype: object),
 (2015,
  7    ROYALS
  Name: Team, dtype: object),
 (2016,
  8    MI
  Name: Team, dtype: object),
 (2017,
  9    CSK
  Name: Team, dtype: object),
 (2018,
  10    KINGS
  Name: Team, dtype: object),
 (2019,
  11    ROYALS
  Name: Team, dtype: object)]

In [77]:
x1 = list(df.groupby(['Year','Points']))
x1[7][0][1] +10,x1[8][0][1] +10,x1[9][0][1] +10,x1[10][0][1] +10,x1[11][0][1] +10

(843, 894, 808, 865, 892)

(894, 808)